validation/naca0012-tmr/iteration1_custom_mesh/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         175;

deltaT          1;

writeControl    timeStep;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    surfaceSampling
    {
        type            surfaces;
        libs            (sampling);
        writeControl    writeTime;
        writeInterval   1;

        surfaceFormat   raw;
        fields          (p U);

        surfaces
        {
            airfoilSurface
            {
                type        patch;
                patches     (walls);
                interpolate true;
            }
        }
    }






    forceCoeffs
    {
        type            forceCoeffs;
        libs            (forces);
        writeControl    timeStep;
        writeInterval   1;

        patches         (walls);
        rho             rhoInf;      // Incompressible assumes rho = 1
        rhoInf          1;           // Reference density

        // The "NASA Recipe" Normalization
        CofR            (0 0 0);     // Center of Rotation (for pitching moment)
        liftDir         (0 1 0);     // Y is Lift
        dragDir         (1 0 0);     // X is Drag
        pitchAxis       (0 0 1);     // Z is the rotation axis

        magUInf         60;          // Your inlet velocity (U)
        lRef            35;          // Your Chord Length (L)
        Aref            1.75;        // Area = 35 * 0.05
    }
    momErr
    {
        type            momentumError;
        libs            (fieldFunctionObjects);
        executeControl  writeTime;
        writeControl    writeTime;
    }

    contErr
    {
        type            div;
        libs            (fieldFunctionObjects);
        field           phi;
        executeControl  writeTime;
        writeControl    writeTime;
    }


    turbulenceFields1
    {
        type            turbulenceFields;
        libs            (fieldFunctionObjects);
        fields
        (
            k
            epsilon
            nut
            nuEff
            R
            devReff
            L
            I
        );

        executeControl  writeTime;
        writeControl    writeTime;
    }

    mag1
    {
        type            mag;
        libs            (fieldFunctionObjects);
        field           turbulenceProperties:R;

        result          magR;
        executeControl  writeTime;
        writeControl    writeTime;
    }
}


// ************************************************************************* //
